<template>
    <div class="bg-gray-400">
        <div
            class="_container flex flex-col gap-5 sm:gap-6 xl:gap-[30px] 2xl:gap-10 py-[60px] sm:py-20 xl:py-[120px] 2xl:py-[200px]">
            <h2 ref="header">Заказать услугу онлайн</h2>
            <div class="w-full h-px bg-gray-100"></div>
            <div class="grid grid-cols-1 gap-5 pb-10 border-b border-gray-100 xl:grid-cols-2 xl:gap-8"
                v-for="(item, i) in [1, 2, 3]" :key="i">

                <div class="flex flex-col gap-5">
                    <div class="flex items-center xl:items-start xl:flex-col gap-4 xl:gap-[30px]">
                        <span
                            class="bg-white rounded-full flex items-center justify-center w-12 h-12 sm:w-[50px] sm:h-[50px] 2xl:h-[60px] 2xl:w-[60px] flex-shrink-0">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_2109_3560)">
                                    <path
                                        d="M9.80469 19.3008C9.73218 19.3009 9.662 19.3273 9.60742 19.375L5.36523 23.0889C4.88035 23.5134 4.13872 23.2174 4.04785 22.6123L4.03809 22.4873V19.6006C4.03787 19.4351 3.90384 19.3008 3.73828 19.3008V18.001C4.62181 18.001 5.33866 18.7171 5.33887 19.6006V21.3838L8.75098 18.3975L8.86426 18.3066C9.13655 18.1087 9.46561 18.0011 9.80469 18.001V19.3008ZM17.7002 18.001V19.3008H9.80469V18.001H17.7002ZM19.7002 16.001V7.55078C19.7001 6.44637 18.8046 5.55089 17.7002 5.55078H3.2998C2.19539 5.55089 1.29991 6.44637 1.2998 7.55078V16.001C1.2998 17.1055 2.19532 18.0009 3.2998 18.001V19.3008C1.47736 19.3007 0 17.8235 0 16.001V7.55078C0.000106684 5.7284 1.47742 4.25108 3.2998 4.25098H17.7002L17.8701 4.25488C19.6135 4.3434 20.9999 5.78538 21 7.55078V16.001L20.9961 16.1709C20.9105 17.8581 19.5573 19.2112 17.8701 19.2969L17.7002 19.3008V18.001C18.8047 18.0009 19.7002 17.1055 19.7002 16.001ZM3.73828 18.001V19.3008H3.2998V18.001H3.73828Z"
                                        fill="#1F1F1F" />
                                    <path
                                        d="M22.3496 13.251V4.55078C22.3495 3.08738 21.1636 1.90147 19.7002 1.90137H6C4.70213 1.90137 3.65039 2.95311 3.65039 4.25098L2.34961 5.20651V4.25098C2.34961 2.23514 3.98416 0.600586 6 0.600586H19.7002C21.8816 0.600691 23.6503 2.36941 23.6504 4.55078V13.251C23.6504 15.2668 22.0158 16.9014 20 16.9014V15.6006C21.2979 15.6006 22.3496 14.5488 22.3496 13.251Z"
                                        fill="#1F1F1F" />
                                    <path
                                        d="M16 7.60059C16.359 7.60059 16.6504 7.89199 16.6504 8.25098C16.6504 8.60996 16.359 8.90137 16 8.90137H4C3.64101 8.90137 3.34961 8.60996 3.34961 8.25098C3.34961 7.89199 3.64101 7.60059 4 7.60059H16Z"
                                        fill="#1F1F1F" />
                                    <path
                                        d="M16 10.6006C16.359 10.6006 16.6504 10.892 16.6504 11.251C16.6504 11.61 16.359 11.9014 16 11.9014H4C3.64101 11.9014 3.34961 11.61 3.34961 11.251C3.34961 10.892 3.64101 10.6006 4 10.6006H16Z"
                                        fill="#1F1F1F" />
                                    <path
                                        d="M11 13.6006C11.359 13.6006 11.6504 13.892 11.6504 14.251C11.6504 14.61 11.359 14.9014 11 14.9014H4C3.64101 14.9014 3.34961 14.61 3.34961 14.251C3.34961 13.892 3.64101 13.6006 4 13.6006H11Z"
                                        fill="#1F1F1F" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_2109_3560">
                                        <rect width="24" height="24" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </span>
                        <h3 class="xl:max-w-[470px] 2xl:max-w-[570px]">Консультация юриста</h3>
                    </div>
                    <span class="text-sm text-black 2xl:text-base text-clamp xl:max-w-[80%]">Наш специалист устно
                        проконсультирует по вопросу
                        таможенного права. Время консультации — 30
                        минут, формат — по телефону или видео.</span>
                </div>
                <div class="flex flex-col xl:flex-row justify-between gap-[30px] xl:items-center mt-auto">
                    <h3 class="font-bold">4 000 ₽</h3>
                    <button @click="openModal('pay')" class="btn btn-main w-fit">
                        <IconArrow />Заказать
                    </button>
                </div>
            </div>
        </div>
        <PayModal v-if="isOpen('pay')" />
    </div>
</template>

<script setup>
const { openModal, closeModal, isOpen } = useModal();
</script>